[
  {
    "title": "Not OTP or links, but hackers now use WhatsApp images for fraud; Check details here",
    "date": "Last Updated: May 25, 2025, 05:28:00 PM IST",
    "summary": "A new WhatsApp image scam is targeting smartphone users. Hackers are hiding malware inside image files. Opening these images can lead to data theft and financial loss. A Jabalpur resident lost 2 lakh. The Department of Telecom has issued a warning. Experts advise caution and security measures. WhatsApp is planning updates to combat this threat.",
    "content": "A new WhatsApp image scam is targeting smartphone users. Hackers are hiding malware inside image files. Opening these images can lead to data theft and financial loss. A Jabalpur resident lost 2 lakh. The Department of Telecom has issued a warning. Experts advise caution and security measures. WhatsApp is planning updates to combat this threat.",
    "bullet_summary": "A new WhatsApp image scam is targeting smartphone users. Hackers are hiding malware inside image files. WhatsApp is planning updates to combat this threat.",
    "url": "https://economictimes.indiatimes.com/news/new-updates/not-otp-or-links-but-hackers-now-use-whatsapp-images-for-fraud-check-details-here/articleshow/121393609.cms",
    "scraped_at": "2025-05-26T21:43:21.000334"
  },
  {
    "title": "Cyber support center set up in Jaipur to strengthen cybersecurity",
    "date": "Last Updated: May 24, 2025, 09:03:00 PM IST",
    "summary": "Rajasthan inaugurated its first Cyber Support Center in Jaipur to combat rising cyber threats. Operated by an NGO and supported by the Kogta Foundation, the center will offer free psychological, legal, and technical assistance to cybercrime victims. It aims to address online harassment, promote cyber wellness, and strengthen cybersecurity through educational initiatives, training programs, and awareness campaigns.",
    "content": "Rajasthan inaugurated its first Cyber Support Center in Jaipur to combat rising cyber threats. Operated by an NGO and supported by the Kogta Foundation, the center will offer free psychological, legal, and technical assistance to cybercrime victims. It aims to address online harassment, promote cyber wellness, and strengthen cybersecurity through educational initiatives, training programs, and awareness campaigns.",
    "bullet_summary": "Rajasthan inaugurated its first Cyber Support Center in Jaipur to combat rising cyber threats. Operated by an NGO and supported by the Kogta Foundation, the center will offer free psychological, legal, and technical assistance to cybercrime victims. It aims to address online harassment, promote cyber wellness, and strengthen cybersecurity through educational initiatives, training programs, and awareness campaigns.",
    "url": "https://economictimes.indiatimes.com/news/india/cyber-support-center-set-up-in-jaipur-to-strengthen-cybersecurity/articleshow/121382771.cms",
    "scraped_at": "2025-05-26T21:43:22.847702"
  },
  {
    "title": "India  Russia eye collaboration on nuclear energy, cybersecurity",
    "date": "Last Updated: May 24, 2025, 12:12:00 AM IST",
    "summary": "India and Russia are strengthening ties. Discussions are underway for joint projects in nuclear energy and cybersecurity. Focus is on cutting-edge technology across sectors. A NITI Aayog team will attend a forum in Russia. They will explore science and technology cooperation. Small modular reactors are being considered. Collaboration extends to semiconductors, AI, and space technology.",
    "content": "TIL CreativesRepresentative ImageNew Delhi: As India readies to amend its contentious nuclear liability laws and boost its cyber defence mechanisms in the aftermath of Operation Sindoor, discussions are learnt to have been started with Russia to forge joint collaborations in nuclear energy and cyber space, besides cutting-edge technology across several sectors, ET has learnt.Deliberations are, in fact, picking pace ahead of Russian President Vladimir Putins India visit this year for the annual bilateral summit, to draw up clear roadmaps.Case in point: A high-level NITI Aayog team is expected to attend the St. Petersburg International Economic Forum next month where a special roundtable on Indo-Russia Science and Technology cooperation is lined up, ET has learnt. Movement is also being quietly made on the nuclear front with a clutch of small modular reactors SMRs being considered as part of the collaboration between the two countries. Russian nuclear firm Rosatom, which built the Kudankulam Nuclear Power Plant NPP, signed a memorandum of understanding this April with Maharashtra for thorium-based SMRs. It is gathered that Rosatom plans to build a number of SMRs and has been in talks with the stakeholders, according to people familiar with the matter. The company is also awaiting a green signal from India for another NPP, they said. There is keen interest to work with India on cybersecurity as well, especially co-development of cyber defence mechanisms, sector specific firewalls as well as cybersecurity products for global markets, it is gathered. Semiconductors, Artificial Intelligence, space technology and critical minerals are among other areas identified for cross-sectoral collaboration on knowledge creation and Brahmos-like co-development models in order to develop an enduring technology base for future products, according to people in the know. In fact, several steps have been taken over the last few months in this direction.Moscow-based non-governmental development organisation -Innopraktika -is readying to set up an Indo-Russian technology association and engineering centre with bases in both countries to spur innovation, it is learnt. Earlier this year, an Innopraktika delegation held discussions with the Indian business community to assess readiness for high-tech product development.Live EventsIn January, Russias leading National Research University - Higher School of Economics HSE and the University of Delhi, in partnership with Geoscan a portfolio company of the Innopraktika non-state development institute, inked an agreement to establish an international scientific mirror laboratory on data storage, processing and transmission in space systems. In November 2024, a Russian Business Center was set up in India to develop trade ties between the two countries, promote export cooperation and provide a platform for interaction between the business communities.Indias digital transformation is also moving in a direction very similar to that in Russia, with rapid growth in fintech, digital government services, e-commerce and smart city infrastructure, said Yury Maksimov, co-founder of Cyberus, a Russia-based international cybersecurity development foundation, adding that this kind of progress demands strong cybersecurity.India is not just a partner but a key player in shaping the future of global cybersecurity and digital architecture, Maksimov told ET.You can now subscribe to our Economic Times WhatsApp channelRead More News onIndia Russia collaborationnuclear energycybersecuritysmall modular reactorsspace technologydigital transformation IndiaRosatomInnopraktikaHigher School of EconomicsCatch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times. Subscribe to The Economic Times Prime and read the ET ePaper online....morelessYou can now subscribe to our Economic Times WhatsApp channelRead More News onIndia Russia collaborationnuclear energycybersecuritysmall modular reactorsspace technologydigital transformation IndiaRosatomInnopraktikaHigher School of EconomicsCatch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times. Subscribe to The Economic Times Prime and read the ET ePaper online....morelessPrime ExclusivesInvestment IdeasStock Report PlusePaperWealth EditionJolt to Çelebi could turn a big gain for this Indian firm that once had deep Turkish tiesWhats slowing Indian ITs AI deals? The answer is hidden in just two words.Why high gold prices are making both banks and their borrowers smileThis is the reason why Infosys terminated hundreds of freshers in MysuruStock Radar: India Cements recovers nearly 40 from lows; moving in upwards channel pattern  time to buy?For risk-takers with medium-term perspective: 6 mid-cap stocks from different sectors with upside potential of over 35123View all Stories",
    "bullet_summary": "Russian nuclear firm Rosatom, which built the Kudankulam Nuclear Power Plant NPP, signed a memorandum of understanding this April with Maharashtra for thorium-based SMRs. Moscow-based non-governmental development organisation -Innopraktika -is readying to set up an Indo-Russian technology association and engineering centre with bases in both countries to spur innovation, it is learnt. Earlier this year, an Innopraktika delegation held discussions with the Indian business community to assess readiness for high-tech product development.",
    "url": "https://economictimes.indiatimes.com/news/india/india-russia-eye-collaboration-on-nuclear-energy-cybersecurity/articleshow/121369011.cms",
    "scraped_at": "2025-05-26T21:43:24.414334"
  },
  {
    "title": "Cyber hackers launched 650 attacks on Indian infrastructure between May 710: Report",
    "date": "Last Updated: May 23, 2025, 09:06:00 PM IST",
    "summary": "The cyber assault by Pakistan-aligned actors began on April 17, weeks before Indias counterterrorism strikes under Operation Sindoor. Quick Heal Technologies Seqrite Labs, a malware analysis facility, identified 650 spear-phishing attacks, malware infections, website defacements, and data leaks carried out by 35 hacktivist groups.",
    "content": "TIL CreativesOver 650 cyber incidents were targeted at Indias critical sectors in a coordinated offensive cyber campaign, launched by Pakistan-aligned state and non-state actors during heightened military tensions earlier this month.Quick Heal Technologies Seqrite Labs, a malware analysis facility, identified spear-phishing attacks, malware infections, website defacements, and data leaks carried out by 35 hacktivist groups. Of these, seven groups are new entrants. These are  Death Slash Cyber Security, Rabbit Cyber Team, Red Wolf Cyber, Dark Cyber Gang, Moroccan Black Cyber Army, Ghosts of Gaza and Tengkorak Cyber Crew, the company said.The cyber assault began on April 17, weeks before Indias counterterrorism strikes between May 7-10. The attackers used malicious documents disguised as official advisories, named as Final_List_of_OGWs.xlam and Preventive_Measures_Sindoor.ppam to deploy malware.At the heart of this digital siege was APT36, a Pakistan-linked advanced persistent threat APT group known for targeting Indian defense and government agencies, Seqrite said.The attackers also spoofed legitimate Indian domains such as nationaldefensecollege.com and zohidsindia.com, using them to deliver payloads and communicate with command-and-control C2 servers hosted at foreign locations. Infrastructure behind the operation was masked using VPS virtual private servers in Russia, Germany, Indonesia, and Singapore.Live EventsThis was not a standalone cyber espionage mission. It was a digitally coordinated war game, Seqrite Labs said in a report released Friday. APT36s evolved tactics combined with simultaneous hacktivist disruptions show how cyber operations have merged with psychological warfare.Discover the stories of your interestBlockchain5 StoriesCyber-safety7 StoriesFintech9 StoriesE-comm9 StoriesML8 StoriesEdtech6 StoriesHacktivist groups used hashtags like OpIndia and OperationSindoor, claiming responsibility for data leaks from municipal databases, defense contractors, telecom operators and hospital networks.Operation Sindoor is a stark reminder of how modern conflicts transcend physical borders, said Seqrite in its advisory. The convergence of nation-state cyber units and ideologically driven hacktivists signals a new era of digital warfareone designed to sow disruption, distrust, and disinformation.Read More News oncyber attacks against IndiaOperation Sindoorcybercriminals in IndiaPakistandigital warfarecybersecurity reportmalware infectionsQuick Heal Technologiesquick heal technologiesRead More News oncyber attacks against IndiaOperation Sindoorcybercriminals in IndiaPakistandigital warfarecybersecurity reportmalware infectionsQuick Heal Technologiesquick heal technologiesPrime ExclusivesInvestment IdeasStock Report PlusePaperWealth EditionJolt to Çelebi could turn a big gain for this Indian firm that once had deep Turkish tiesWhats slowing Indian ITs AI deals? The answer is hidden in just two words.Why high gold prices are making both banks and their borrowers smileThis is the reason why Infosys terminated hundreds of freshers in MysuruStock Radar: India Cements recovers nearly 40 from lows; moving in upwards channel pattern  time to buy?For risk-takers with medium-term perspective: 6 mid-cap stocks from different sectors with upside potential of over 35123View all Stories",
    "bullet_summary": "These are Death Slash Cyber Security, Rabbit Cyber Team, Red Wolf Cyber, Dark Cyber Gang, Moroccan Black Cyber Army, Ghosts of Gaza and Tengkorak Cyber Crew, the company said. Live EventsThis was not a standalone cyber espionage mission. APT36s evolved tactics combined with simultaneous hacktivist disruptions show how cyber operations have merged with psychological warfare.",
    "url": "https://economictimes.indiatimes.com/tech/technology/cyber-hackers-launched-650-attacks-on-indian-infrastructure-between-may-710-report/articleshow/121367078.cms",
    "scraped_at": "2025-05-26T21:43:26.275594"
  },
  {
    "title": "ETtech Deals Digest: Indian startups raise 177 million this week, led by EV and healthtech bets",
    "date": "Last Updated: May 23, 2025, 08:54:00 PM IST",
    "summary": "Indian startups raised 177.6 million from 15 deals between May 17 and 23, a 2.7x rise year-on-year and up 12.7 from last week. Major deals included Euler Motors , CureBay, Cloudsek, and Mythik. Despite fewer deals compared to the same period last year., funding volumes saw a significant boost.",
    "content": "ETtechIndian startups raised about 177.6 million during the week of May 17 to May 23, marking a 2.7x increase from the 65.8 million they secured during the same period last year, as per data from Tracxn.The funding tally also rose 12.7 from last weeks 157.7 million. However, the number of deals fell to 15 from 34 in the corresponding week a year ago, underscoring continued investor caution and a focus on select, high-conviction bets.ETtechTop deals of the week:Euler Motors: The electric commercial vehicle manufacturer raised around 75 million in a round led by Hero MotoCorp. British International Investment BII, the UK governments development finance institution, also participated.Live EventsCureBay: Tech-enabled hybrid healthcare platform CureBay raised 21 million in a funding round led by Bertelsmann India Investments. BII and existing investor Elevar Equity also took part.Discover the stories of your interestBlockchain5 StoriesCyber-safety7 StoriesFintech9 StoriesE-comm9 StoriesML8 StoriesEdtech6 StoriesCloudsek: Predictive cybersecurity Cloudsek raised 19 million in a fresh funding round led by Tenacity Ventures and Commvault. Others participating in the round include Inflexor Ventures, MassMutual Ventures and Prana Ventures, along with some strategic investors.Mythik: Media technology company Mythik, founded by former Housing.com and Freecharge CEO Jason Kothari, raised 15 million in a funding round from Sakal Media Group, Venture Catalysts-backed VC Grid, actor Shah Rukh Khans family office, and Visceral Capital, among others.ETtechRead More News onstartups fundinginvestment dealsventure capitalEuler MotorsCureBayCloudsekelectric vehicles fundingMythikhealthcare startupsHero MotoCorpRead More News onstartups fundinginvestment dealsventure capitalEuler MotorsCureBayCloudsekelectric vehicles fundingMythikhealthcare startupsHero MotoCorpPrime ExclusivesInvestment IdeasStock Report PlusePaperWealth EditionJolt to Çelebi could turn a big gain for this Indian firm that once had deep Turkish tiesWhats slowing Indian ITs AI deals? The answer is hidden in just two words.Why high gold prices are making both banks and their borrowers smileThis is the reason why Infosys terminated hundreds of freshers in MysuruStock Radar: India Cements recovers nearly 40 from lows; moving in upwards channel pattern  time to buy?For risk-takers with medium-term perspective: 6 mid-cap stocks from different sectors with upside potential of over 35123View all Stories",
    "bullet_summary": "8 million they secured during the same period last year, as per data from Tracxn. 7 from last weeks 157. Others participating in the round include Inflexor Ventures, MassMutual Ventures and Prana Ventures, along with some strategic investors.",
    "url": "https://economictimes.indiatimes.com/tech/funding/ettech-deals-digest-startups-raise-177-6-million-this-week-up-2-7-times-on-year/articleshow/121366252.cms",
    "scraped_at": "2025-05-26T21:43:28.143868"
  },
  {
    "title": "BRICS trade ministers meet: India calls for dismantling export controls among members",
    "date": "Last Updated: May 23, 2025, 07:59:00 PM IST",
    "summary": "India has requested BRICS countries to remove export restrictions to promote commerce. Yashvir Singh represented India at the BRICS trade ministers meeting in Brazil. India will assume the BRICS Presidency in 2026. India proposed 30 for 30 to mark WTOs 30th anniversary. India has asked developed nations to ensure concessional transfer of Environmentally Sound Technologies.",
    "content": "India has requested BRICS countries to remove export restrictions to promote commerce. Yashvir Singh represented India at the BRICS trade ministers meeting in Brazil. India will assume the BRICS Presidency in 2026. India proposed 30 for 30 to mark WTOs 30th anniversary. India has asked developed nations to ensure concessional transfer of Environmentally Sound Technologies.",
    "bullet_summary": "India has requested BRICS countries to remove export restrictions to promote commerce. Yashvir Singh represented India at the BRICS trade ministers meeting in Brazil. India will assume the BRICS Presidency in 2026.",
    "url": "https://economictimes.indiatimes.com/news/economy/foreign-trade/brics-trade-ministers-meet-india-calls-for-dismantling-export-controls-among-members/articleshow/121366146.cms",
    "scraped_at": "2025-05-26T21:43:30.163732"
  },
  {
    "title": "Titan Capital launches investment vertical to back defence-tech founders",
    "date": "Last Updated: May 23, 2025, 07:06:00 PM IST",
    "summary": "Titan Capital has launched a specialised investment vertical to fund Indian startups innovating in defence and strategic technology, focusing on areas like advanced hardware, aerospace, and cybersecurity. The firm aims to foster deep-tech innovation and help India become a net exporter of strategic technologies.",
    "content": "Titan Capital co-founders Rohit Bansal and Kunal Bahl. NEW DELHI: Titan Capital, a seed-stage venture capital firm, has announced the launch of a specialised investment vertical to fund startups innovating in Indias defence and strategic technology space.With this program, Titan Capital is actively seeking to invest in startups working at the intersection of advanced hardware, aerospace, cybersecurity, and manufacturing. The focus is not only on national security but also on fostering deep-tech innovation, creating high-value jobs, and helping India become a net exporter of strategic technologies.Kunal Bahl, Co-founder of Titan Capital, said in a statement, We are at a historic inflection point where national security, deep-tech innovation, and startup agility are converging. India cannot achieve true self-reliance in defence by relying on imports or public funding alone. We need to back our brightest mindsengineers, researchers, and buildersto create sovereign, dual-use technologies that can shape not just Indias future, but the future of global defence. At Titan, weve always been a founder-first firm. This vertical extends that ethos into a sector that has national consequence.As part of this initiative, Titan Capital is also looking to collaborate with veterans from the armed forces, scientists, and experienced technologists who can help assess and guide these investments with strategic insight and domain expertise.Globally, venture capital is accelerating its focus on defence-tech. U.S.-based Anduril Industries recently raised 1.5 billion for its AI-enabled combat systems, while Europes Helsing secured 450 million in backing from General Catalyst to develop defence AI. India is now at the brink of a similar inflection, and Titan Capital wants to ensure that the ecosystem doesnt miss its moment.Live EventsThe Indian government has increased the defence budget to Rs 6.81 lakh crore for FY 202526 and launched schemes like iDEX and the Technology Development Fund TDF to support homegrown solutions. But capital gaps remain for early-stage companies working on complex, high-risk, high-reward technologiesprecisely where venture capital firms like Titan Capital can play a catalytic role by unlocking speed, conviction, and long-term support that traditional systems often lack.Titan Capital has backed over 250 startups to date, including Ola, Razorpay, Urban Company, OfBusiness and Giva. Read More News ontitan capitalkunal bahldefense tech startups indiaaerospace startupscybersecurityRead More News ontitan capitalkunal bahldefense tech startups indiaaerospace startupscybersecurityPrime ExclusivesInvestment IdeasStock Report PlusePaperWealth EditionJolt to Çelebi could turn a big gain for this Indian firm that once had deep Turkish tiesWhats slowing Indian ITs AI deals? The answer is hidden in just two words.Why high gold prices are making both banks and their borrowers smileThis is the reason why Infosys terminated hundreds of freshers in MysuruStock Radar: India Cements recovers nearly 40 from lows; moving in upwards channel pattern  time to buy?For risk-takers with medium-term perspective: 6 mid-cap stocks from different sectors with upside potential of over 35123View all Stories",
    "bullet_summary": "Titan Capital co-founders Rohit Bansal and Kunal Bahl. NEW DELHI: Titan Capital, a seed-stage venture capital firm, has announced the launch of a specialised investment vertical to fund startups innovating in Indias defence and strategic technology space. Globally, venture capital is accelerating its focus on defence-tech.",
    "url": "https://economictimes.indiatimes.com/small-biz/entrepreneurship/titan-capital-launches-investment-vertical-to-back-defence-tech-founders/articleshow/121352731.cms",
    "scraped_at": "2025-05-26T21:43:32.170580"
  },
  {
    "title": "Six-member board to regulate payment systems: RBI notification",
    "date": "Last Updated: May 23, 2025, 06:06:00 PM IST",
    "summary": "The RBI governor will head a six-member Payments Regulatory Board PRB, including three central government nominees, to regulate and supervise payment systems, replacing the BPSS. The new board composition aligns with the Finance Bill announcements, despite the RBIs initial objections to external regulation. Experts believe this structure could foster innovation while maintaining stringent governance and consumer protection.",
    "content": "The RBI governor will head a six-member Payments Regulatory Board PRB, including three central government nominees, to regulate and supervise payment systems, replacing the BPSS. The new board composition aligns with the Finance Bill announcements, despite the RBIs initial objections to external regulation. Experts believe this structure could foster innovation while maintaining stringent governance and consumer protection.",
    "bullet_summary": "The RBI governor will head a six-member Payments Regulatory Board PRB, including three central government nominees, to regulate and supervise payment systems, replacing the BPSS. The new board composition aligns with the Finance Bill announcements, despite the RBIs initial objections to external regulation. Experts believe this structure could foster innovation while maintaining stringent governance and consumer protection.",
    "url": "https://economictimes.indiatimes.com/news/economy/policy/six-member-board-to-regulate-payment-systems-rbi-notification/articleshow/121364177.cms",
    "scraped_at": "2025-05-26T21:43:34.136860"
  },
  {
    "title": "Vietnam acts to block messaging app Telegram, government document shows",
    "date": "Last Updated: May 23, 2025, 12:17:00 PM IST",
    "summary": "The document said the ministry was acting on behalf of the countrys cyber-security department after police reported that 68 of the 9,600 Telegram channels and groups in the country violated the law, citing fraud, drug trafficking and cases suspected of being related to terrorism among the illegal activities carried out through the app.",
    "content": "ReutersVietnams technology ministry has instructed telecommunication service providers to block the messaging app Telegram for not cooperating in combating alleged crimes committed by its users, according to a government document reviewed by Reuters. The document, dated May 21 and signed by the deputy head of the telecom department at the technology ministry, ordered telecommunication companies to take measures to block Telegram and report on them to the ministry by June 2. The document said the ministry was acting on behalf of the countrys cyber-security department after police reported that 68 of the 9,600 Telegram channels and groups in the country violated the law, citing fraud, drug trafficking and cases suspected of being related to terrorism among the illegal activities carried out through the app. A technology ministry official confirmed to Reuters the authenticity of the document, noting the move follows Telegrams failure to share user data with the government when asked as part of criminal investigations. Telegram and Vietnams technology ministry did not immediately reply to requests for comment.Live Events Telegram, which competes globally with other social media apps such as Facebooks WhatsApp and WeChat, was still available in Vietnam on Friday. Discover the stories of your interestBlockchain5 StoriesCyber-safety7 StoriesFintech9 StoriesE-comm9 StoriesML8 StoriesEdtech6 StoriesRead More News onVietnam blocks TelegramTelegram app banVietnam cyber security lawsTelegram illegal activitiesblock messaging appsvietnamTelegramRead More News onVietnam blocks TelegramTelegram app banVietnam cyber security lawsTelegram illegal activitiesblock messaging appsvietnamTelegramPrime ExclusivesInvestment IdeasStock Report PlusePaperWealth EditionJolt to Çelebi could turn a big gain for this Indian firm that once had deep Turkish tiesWhats slowing Indian ITs AI deals? The answer is hidden in just two words.Why high gold prices are making both banks and their borrowers smileThis is the reason why Infosys terminated hundreds of freshers in MysuruStock Radar: India Cements recovers nearly 40 from lows; moving in upwards channel pattern  time to buy?For risk-takers with medium-term perspective: 6 mid-cap stocks from different sectors with upside potential of over 35123View all Stories",
    "bullet_summary": "ReutersVietnams technology ministry has instructed telecommunication service providers to block the messaging app Telegram for not cooperating in combating alleged crimes committed by its users, according to a government document reviewed by Reuters. Telegram and Vietnams technology ministry did not immediately reply to requests for comment. Discover the stories of your interestBlockchain5 StoriesCyber-safety7 StoriesFintech9 StoriesE-comm9 StoriesML8 StoriesEdtech6 StoriesRead More News onVietnam blocks TelegramTelegram app banVietnam cyber security lawsTelegram illegal activitiesblock messaging appsvietnamTelegramRead More News onVietnam blocks TelegramTelegram app banVietnam cyber security lawsTelegram illegal activitiesblock messaging appsvietnamTelegramPrime ExclusivesInvestment IdeasStock Report PlusePaperWealth EditionJolt to Çelebi could turn a big gain for this Indian firm that once had deep Turkish tiesWhats slowing Indian ITs AI deals.",
    "url": "https://economictimes.indiatimes.com/tech/technology/vietnam-acts-to-block-messaging-app-telegram-government-document-shows/articleshow/121356439.cms",
    "scraped_at": "2025-05-26T21:43:35.915112"
  },
  {
    "title": "New e-Zero FIR: Govt launches pilot project for swift action against cybercrimes; how it can help you",
    "date": "Last Updated: May 22, 2025, 05:08:00 PM IST",
    "summary": "The initiative, which was launched as a pilot project in Delhi, will automatically convert eligible cybercrime complaints into FIRs and is currently applicable to financial frauds involving amounts exceeding Rs 10 lakh.",
    "content": "ET OnlineThe Government of India has recently launched e-Zero FIR, a new system designed to strengthen cybersecurity and expedite probes in high-value cyber financial crimes. The initiative, which was launched as a pilot project in Delhi, will automatically convert eligible cybercrime complaints into FIRs and is currently applicable to financial frauds involving amounts exceeding Rs 10 lakh. The government seeks to accelerate investigations and take swift action against cybercriminals through this new initiative.Is there a new government scheme offering earnings of Rs 10,000 per day? PIB clarifiesThe Indian Cybercrime Coordination Centre I4C, a nodal agency established by the Ministry of Home Affairs MHA, has introduced the new e-Zero FIR initiative to nab any criminal with unprecedented speed, stated Amit Shah, Union Home Minister and Minister of Cooperation, on May 19, 2025, in a release by MHA.Launched as a pilot project for Delhi, the new system will automatically convert cyber financial crimes filed at NCRP or 1930 to FIRs, initially above the threshold limit of Rs 10 lakh. The new system, which will drive investigations swiftly cracking down on cybercriminals, will soon be extended to the entire nation. The Modi government is bolstering the cybersecurity grid to build a Cyber-Secure Bharat, Shah stated further.How the auto FIR process will work for high-value cyber fraud complaintsThe new mechanism will automatically convert complaints lodged through the National Cybercrime Reporting Portal NCRP and the Cybercrime Helpline 1930 into Zero FIRs, specifically for cases exceeding the Rs 10-lakh threshold. These FIRs will be filed electronically at the e-Crime Police Station in Delhi and subsequently transferred to the appropriate territorial cybercrime police stations.Live EventsSandesh G S, CTO, Bureau, says, When it comes to protecting customers from fraud, two things matter above all- speed and context. The I4Cs latest initiative addresses both. Weve seen that when victims report fraud within the golden hour, the likelihood of loss reduction improves by up to 23. Coupled with automatic FIR registration and routing to local cybercrime units, this drastically reduces procedural delays and enables faster action. But speed alone isnt enough. We cant see fraud as isolated events today; we know its a syndicated, structured operation. What appears to be a single case is often part of a broader network. Our experience at Bureau reflects this reality. Through our Graph Identity Network GIN, we tap into contextual intelligence that connects fraud attempts across identities, devices, and accounts, giving us invaluable intel into the end destination of money flows and uncovering associations with known fraudsters. Real-time reporting, combined with deep network visibility, can give us the clarity and speed needed to detect and dismantle fraud syndicates more effectively.Complainants will have a maximum of three days to visit the concerned police station and convert their Zero FIR into a regular FIR, thereby facilitating a more efficient legal process and faster resolution. While this auto-FIR initiative is currently being rolled out as a pilot in Delhi, the government plans to extend it to other states and Union Territories in the coming phases. The long-term vision is to build a cyber-secure Bharat. The e-Crime Police Station of Delhi has already been officially notified to handle the registration and routing of e-FIRs for specific cybercrime complaints submitted through the NCRP platform. AmitShah AmitShah  Originally published on May 21, 2025 Read More News oncybersecurityIndian Cybercrime Coordination Centrefinancial fraudcyber financial crimesNational Cybercrime Reporting Portalcybercrime investigationsDelhi policeCatch all the Personal Finance News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times. Subscribe to ET Prime and read the ET ePaper online....morelessRead More News oncybersecurityIndian Cybercrime Coordination Centrefinancial fraudcyber financial crimesNational Cybercrime Reporting Portalcybercrime investigationsDelhi policeCatch all the Personal Finance News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times. Subscribe to ET Prime and read the ET ePaper online....moreless",
    "bullet_summary": "The initiative, which was launched as a pilot project in Delhi, will automatically convert eligible cybercrime complaints into FIRs and is currently applicable to financial frauds involving amounts exceeding Rs 10 lakh. Launched as a pilot project for Delhi, the new system will automatically convert cyber financial crimes filed at NCRP or 1930 to FIRs, initially above the threshold limit of Rs 10 lakh. How the auto FIR process will work for high-value cyber fraud complaintsThe new mechanism will automatically convert complaints lodged through the National Cybercrime Reporting Portal NCRP and the Cybercrime Helpline 1930 into Zero FIRs, specifically for cases exceeding the Rs 10-lakh threshold.",
    "url": "https://economictimes.indiatimes.com/wealth/save/new-e-zero-fir-govt-launches-pilot-for-swift-action-against-cybercrimes-how-it-can-help-you/articleshow/121314437.cms",
    "scraped_at": "2025-05-26T21:43:37.855648"
  },
  {
    "title": "Unified Data-Tech IPO opens for subscription: Check GMP, price band and others",
    "date": "Last Updated: May 22, 2025, 10:31:00 AM IST",
    "summary": "Unified Data-Tech Solutions launched its IPO on May 22, aiming to raise Rs 144.47 crore through an offer for sale. With a price band of Rs 260-273 per share, the IPO closes on May 26 and anticipates listing on the BSE SME platform. The company, specializing in IT solutions, reported strong financials and expects a listing price around 331.",
    "content": "ETMarkets.comThe company has set a price band of Rs 260 to Rs 273 per share. Investors can bid for a minimum of 400 shares in one lot, requiring an investment of Rs 1,09,200 at the upper end of the price band.Unified Data-Tech Solutions, a Mumbai-based IT services company, opened its initial public offering IPO for subscription on May 22. The Rs 144.47 crore issue is entirely an offer for sale OFS of 52.92 lakh equity shares by existing shareholders. The IPO will remain open until May 26 and the shares are proposed to be listed on the BSE SME platform.The company has set a price band of Rs 260 to Rs 273 per share. Investors can bid for a minimum of 400 shares in one lot, requiring an investment of Rs 1,09,200 at the upper end of the price band.Unified Data-Tech IPO GMPUnified Data-Tech SME IPOs latest grey market premium GMP is Rs 58, as of May 21, 2025, 6:54 PM. Based on the upper price band of Rs 273, the stock is expected to list at around 331. This means investors could see a potential gain of 21.25 per share on listing day.Hem Securities is the sole book-running lead manager to the issue, while KFin Technologies has been appointed as the registrar.Live EventsUnified Data-Tech IPO detailsFounded in 2010, Unified Data-Tech Solutions is a tech-enabled system integrator offering data center, cybersecurity, cloud computing, and IT infrastructure solutions. The company works with large corporations across banking, finance, and IT sectors, helping them set up secure, high-performance digital systems.The company has a client base of over 1,000 businesses and has expanded its presence with offices in Pune and Ahmedabad. Its services range from system integration and architecture consulting to technical support for digital transformation projects.For the eleven months ended February 28, 2025, the company reported revenue of Rs 203.66 crore and a net profit of Rs 31.68 crore. The company has remained debt-free and has consistently grown its revenue and profitability over the past three years.The basis of allotment will be finalized on May 27, while listing is expected to take place on May 29.Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of Economic TimesYou can now subscribe to our ETMarkets WhatsApp channelRead More News onkfin technologiesWhats moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds . Subscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today. Top Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price...morelessYou can now subscribe to our ETMarkets WhatsApp channelRead More News onkfin technologiesWhats moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds . Subscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today. Top Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price...morelessPrime ExclusivesInvestment IdeasStock Report PlusePaperWealth EditionJolt to Çelebi could turn a big gain for this Indian firm that once had deep Turkish tiesWhats slowing Indian ITs AI deals? The answer is hidden in just two words.Why high gold prices are making both banks and their borrowers smileThis is the reason why Infosys terminated hundreds of freshers in MysuruStock Radar: India Cements recovers nearly 40 from lows; moving in upwards channel pattern  time to buy?For risk-takers with medium-term perspective: 6 mid-cap stocks from different sectors with upside potential of over 35123View all Stories",
    "bullet_summary": "Unified Data-Tech Solutions, a Mumbai-based IT services company, opened its initial public offering IPO for subscription on May 22. Unified Data-Tech IPO GMPUnified Data-Tech SME IPOs latest grey market premium GMP is Rs 58, as of May 21, 2025, 6:54 PM. Live EventsUnified Data-Tech IPO detailsFounded in 2010, Unified Data-Tech Solutions is a tech-enabled system integrator offering data center, cybersecurity, cloud computing, and IT infrastructure solutions.",
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/unified-data-tech-ipo-opens-today-check-subscription-gmp-price-band-and-others/articleshow/121327761.cms",
    "scraped_at": "2025-05-26T21:43:39.671856"
  },
  {
    "title": "India Inc shoring up its cybersecurity spends amid spillover threats",
    "date": "Last Updated: May 22, 2025, 08:33:00 AM IST",
    "summary": "Following recent India-Pakistan tensions, Indian companies are bolstering their cybersecurity defenses. Heightened cyberattacks have prompted large and mid-sized firms, particularly in BFSI and critical infrastructure, to reassess their readiness. As per data from Kasperskys ICS CERT industrial control systems cyber emergency response team report for Q1 2025, malicious objects were blocked on 19.1 of ICS computers globally.",
    "content": "Following recent India-Pakistan tensions, Indian companies are bolstering their cybersecurity defenses. Heightened cyberattacks have prompted large and mid-sized firms, particularly in BFSI and critical infrastructure, to reassess their readiness. As per data from Kasperskys ICS CERT industrial control systems cyber emergency response team report for Q1 2025, malicious objects were blocked on 19.1 of ICS computers globally.",
    "bullet_summary": "Following recent India-Pakistan tensions, Indian companies are bolstering their cybersecurity defenses. Heightened cyberattacks have prompted large and mid-sized firms, particularly in BFSI and critical infrastructure, to reassess their readiness. As per data from Kasperskys ICS CERT industrial control systems cyber emergency response team report for Q1 2025, malicious objects were blocked on 19.",
    "url": "https://economictimes.indiatimes.com/tech/technology/india-inc-shoring-up-its-cybersecurity-spends-amid-spillover-threats/articleshow/121321439.cms",
    "scraped_at": "2025-05-26T21:43:41.550617"
  }
]